from enum import Enum, auto
class AdMode(Enum):
     OR = auto()
     AND = auto()

import re
AD_FILTER_FLAGS = re.IGNORECASE

autoria = r"(.+)?auto\.ria\.com(.+)?"
что_угодно = r"(.+)?"
сумма = r"(\d+([\.,]\d+)?)"
продам = r"(\s{0,30}[по][рт][оаі]да([мю]|[её]тся)\s{0,30}})"
слова = r"(([а-яa-z]+(\s{1,30}))+)"
валюта = r"(грн|usd|грв|\$|UAH|хрн|гривен|грив|гривні(в)?|хривен|(у\.?(\s{1,30})?е\.?))"

def возможно(arg):
    return arg + r"?"

AD_FILTERS = [
    # autoria
    { "mode": AdMode.OR, "rxes" : [r"(.+)?auto\.ria\.com(.+)?"]},

    # <что угодно>продам<слова><сумма><валюта><что_угодно>
    #r"([по][рт][оа]да([мю]|[её]тся)(\s+)?)(([а-яa-z]+(\s{1,30})?)+)(\d+([\.,]\d+)?\s{0,30})(([а-яa-z]+(\s{1,30}))+)?(грн|usd|грв|\$|UAH|хрн|гривен|грив|гривні(в)?|хривен|(у\.?(\s{1,30})?е\.?))(.+)?"
    { "mode": AdMode.AND , "rxes": [
            r"([по][рт][оа]да([мю]|[её]тся))",
            r"(грн|usd|грв|\$|UAH|хрн|гривен|грив|гривні(в)?|хривен|(у\.?(\s{1,30})?е\.?))(.+)?(\d+([\.,]\d+)?)"]},
            
    { "mode": AdMode.AND , "rxes": [
            r"([по][рт][оа]да([мю]|[её]тся))",
            r"(\d+([\.,]\d+)?)(.+)?(грн|usd|грв|\$|UAH|хрн|гривен|грив|гривні(в)?|хривен|(у\.?(\s{1,30})?е\.?))"]}
    #что_угодно + продам + слова + сумма + возможно(слова) + валюта + что_угодно
    # <сумма><валюта>продам<слова>
    #сумма + возможно(слова) + продам + слова
]